# vim: set foldmethod=marker foldlevel=1 nomodeline:
# ============================================================================
# Tap Repsitories {{{
# ============================================================================
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "saadparwaiz1/personal"
# }}}
# ============================================================================
# Text Editors {{{
# ============================================================================
brew "neovim", args: ["HEAD"]
# }}}
# ============================================================================
# Productivity {{{
# ============================================================================
cask "skim"
cask "alfred"
cask "alt-tab"
cask "smcfancontrol"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd", args: ["with-logging"]
# }}}
# ============================================================================
# Entertainment {{{
# ============================================================================
cask "spotify"
# }}}
# ============================================================================
# Package Managers {{{
# ============================================================================
brew "luarocks"
brew "saadparwaiz1/personal/zinit"
# }}}
# ============================================================================
# Terminal Emulators {{{
# ============================================================================
cask "kitty"
# }}}
# ============================================================================
# Shell Tools{{{
# ============================================================================
brew "fd"
brew "gh"
brew "fzf"
brew "exa"
brew "ffmpeg"
brew "pandoc"
brew "ripgrep"
brew "pygments"
brew "diff-so-fancy"
# }}}
# ============================================================================
# Shells {{{
# ============================================================================
brew "bash"
# }}}
# ============================================================================
# Browsers {{{
# ============================================================================
cask "firefox"
# }}}
# ============================================================================
# Fonts {{{
# ============================================================================
cask "font-jetbrains-mono-nerd-font"
# }}}
# ============================================================================
# Conferencing {{{
# ============================================================================
cask "zoom"
cask "signal"
cask "discord"
# }}}
# ============================================================================
# Tooling {{{
# ============================================================================
brew "cmake"
brew "shfmt"
# }}}
# ============================================================================
# Language Servers {{{
# ============================================================================
brew "texlab"
brew "saadparwaiz1/personal/lua-language-server"
# }}}
# ============================================================================
# Compilers {{{
# ============================================================================
# }}}
# ============================================================================
# Interpreters {{{
# ============================================================================
brew "node"
brew "python@3.9"
# }}}
# ============================================================================
# Writing {{{
# ============================================================================
cask "mactex-no-gui"
cask "microsoft-word"
cask "microsoft-excel"
# }}}
# ============================================================================
