# vim: set foldmethod=marker foldlevel=1 nomodeline:
# ============================================================================
# Tap Repsitories {{{
# ============================================================================
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "saadparwaiz1/core"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
# }}}
# ============================================================================
# Text Editors {{{
# ============================================================================
brew "neovim", args: ["HEAD"]
# }}}
# ============================================================================
# Productivity {{{
# ============================================================================
cask "alfred"
cask "alt-tab"
cask "adguard"
brew "koekeishiya/formulae/skhd", args: ["with-logging"]
brew "koekeishiya/formulae/yabai"
# }}}
# ============================================================================
# Entertainment {{{
# ============================================================================
cask "spotify"
# }}}
# ============================================================================
# Package Managers {{{
# ============================================================================
brew "mas"
brew "saadparwaiz1/core/zinit", args: ["HEAD"]
# }}}
# ============================================================================
# Terminal Emulators {{{
# ============================================================================
cask "kitty"
# }}}
# ============================================================================
# Shell Tools{{{
# ============================================================================
brew "fd"
brew "fzf"
brew "bat"
brew "shfmt"
brew "shellcheck"
brew "diff-so-fancy"
brew "the_silver_searcher"
# }}}
# ============================================================================
# Shells {{{
# ============================================================================
brew "bash"
brew "zsh"
# }}}
# ============================================================================
# Browsers {{{
# ============================================================================
cask "firefox"
# }}}
# ============================================================================
# Fonts {{{
# ============================================================================
cask "font-jetbrains-mono-nerd-font"
# }}}
# ============================================================================
# Conferencing {{{
# ============================================================================
cask "zoom"
# }}}
# ============================================================================
# Build Tools {{{
# ============================================================================
# }}}
# ============================================================================
# Language Servers {{{
# ============================================================================
brew "saadparwaiz1/core/lua-language-server"
# }}}
# ============================================================================
# Compilers {{{
# ============================================================================
# }}}
# ============================================================================
# Interpreters {{{
# ============================================================================
brew "node"
brew "python@3.9"
brew "luajit", args: ["HEAD"]
# }}}
# ============================================================================
# Language Servers {{{
# ============================================================================
# }}}
# ============================================================================
# App Store Apps{{{
# ============================================================================
mas "1Password 7", id: 1333542190
mas "NordVPN IKE", id: 1116599239
# }}}
# ============================================================================
