# vim: set foldmethod=marker foldlevel=1 nomodeline:
# ============================================================================
# Tap Repsitories {{{
# ============================================================================
tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/services"
tap "saadparwaiz1/personal"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
# }}}
# ============================================================================
# Text Editors {{{
# ============================================================================
brew "neovim", args: ["HEAD"]
# }}}
# ============================================================================
# Productivity {{{
# ============================================================================
cask "alfred"
cask "alt-tab"
cask "adguard"
brew "koekeishiya/formulae/skhd", args: ["with-logging"]
brew "koekeishiya/formulae/yabai"
# }}}
# ============================================================================
# Entertainment {{{
# ============================================================================
# }}}
# ============================================================================
# Package Managers {{{
# ============================================================================
brew "saadparwaiz1/personal/zinit"
# }}}
# ============================================================================
# Terminal Emulators {{{
# ============================================================================
cask "kitty"
# }}}
# ============================================================================
# Shell Tools{{{
# ============================================================================
brew "fd"
brew "gh"
brew "fzf"
brew "exa"
brew "glab"
brew "shfmt"
brew "ripgrep"
brew "diff-so-fancy"
# }}}
# ============================================================================
# Shells {{{
# ============================================================================
brew "bash"
# }}}
# ============================================================================
# Browsers {{{
# ============================================================================
# }}}
# ============================================================================
# Fonts {{{
# ============================================================================
cask "font-jetbrains-mono-nerd-font"
# }}}
# ============================================================================
# Conferencing {{{
# ============================================================================
cask "zoom"
cask "signal"
cask "discord"
# }}}
# ============================================================================
# Build Tools {{{
# ============================================================================
# }}}
# ============================================================================
# Language Servers {{{
# ============================================================================
brew "saadparwaiz1/personal/lua-language-server"
# }}}
# ============================================================================
# Compilers {{{
# ============================================================================
# }}}
# ============================================================================
# Interpreters {{{
# ============================================================================
brew "node"
brew "python@3.9"
# }}}
# ============================================================================
